# LineLoadType Class (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
LineLoadType Class
Members See Also
---
An object that represents a Load type.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
# Syntax
C#
---
```text
public class LineLoadType : LoadTypeBase
```

Visual Basic
---
```text
Public Class LineLoadType _
	Inherits LoadTypeBase
```

Visual C++
---
```text
public ref class LineLoadType : public LoadTypeBase
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..ElementType Autodesk.Revit.DB.Structure..::..LoadTypeBase Autodesk.Revit.DB.Structure..::..LineLoadType
# See Also
LineLoadType Members
Autodesk.Revit.DB.Structure Namespace